In [1]:
import warnings
warnings.filterwarnings('ignore')
import seaborn as sns
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt

In [212]:
oil_df=pd.read_csv("oil.csv")
hol_df=pd.read_csv("holidays_events.csv")
train_df=pd.read_csv("train.csv")
trans_df=pd.read_csv('transactions.csv')
test_df=pd.read_csv('test.csv')
store_df=pd.read_csv('stores.csv')
sub_df=pd.read_csv("sample_submission.csv")

In [289]:
test_df.head()

        id       date  store_nbr  family  onpromotion  year  month  day
0  3000888 2017-08-16          1       0            0  2017      8   16
1  3000889 2017-08-16          1       1            0  2017      8   16
2  3000890 2017-08-16          1       2            2  2017      8   16
3  3000891 2017-08-16          1       3           20  2017      8   16
4  3000892 2017-08-16          1       4            0  2017      8   16

In [213]:
oil_df.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

In [214]:
train_df['onpromotion'].fillna(0, inplace=True)
test_df['onpromotion'].fillna(0,inplace=True)

In [215]:
oil_df.head()

         date  dcoilwtico
0  2013-01-01         NaN
1  2013-01-02       93.14
2  2013-01-03       92.97
3  2013-01-04       93.12
4  2013-01-07       93.20

## Preprocessing

In [216]:
train_df['date'] = pd.to_datetime(train_df['date'])
test_df['date'] = pd.to_datetime(test_df['date'])
oil_df['date'] = pd.to_datetime(oil_df['date'])
hol_df['date'] = pd.to_datetime(hol_df['date'])


train_df['year'] = train_df['date'].dt.year
train_df['month'] = train_df['date'].dt.month
train_df['day'] = train_df['date'].dt.day

test_df['year'] = test_df['date'].dt.year
test_df['month'] = test_df['date'].dt.month
test_df['day'] = test_df['date'].dt.day

oil_df['year'] = oil_df['date'].dt.year
oil_df['month'] = oil_df['date'].dt.month
oil_df['day'] = oil_df['date'].dt.day

hol_df['year'] = hol_df['date'].dt.year
hol_df['month'] = hol_df['date'].dt.month
hol_df['day'] = hol_df['date'].dt.day

In [217]:
oil_df.head(),train_df.head(),test_df.head()

(        date  dcoilwtico  year  month  day
 0 2013-01-01         NaN  2013      1    1
 1 2013-01-02       93.14  2013      1    2
 2 2013-01-03       92.97  2013      1    3
 3 2013-01-04       93.12  2013      1    4
 4 2013-01-07       93.20  2013      1    7,
    id       date  store_nbr      family  sales  onpromotion  year  month  day
 0   0 2013-01-01          1  AUTOMOTIVE    0.0            0  2013      1    1
 1   1 2013-01-01          1   BABY CARE    0.0            0  2013      1    1
 2   2 2013-01-01          1      BEAUTY    0.0            0  2013      1    1
 3   3 2013-01-01          1   BEVERAGES    0.0            0  2013      1    1
 4   4 2013-01-01          1       BOOKS    0.0            0  2013      1    1,
         id       date  store_nbr      family  onpromotion  year  month  day
 0  3000888 2017-08-16          1  AUTOMOTIVE            0  2017      8   16
 1  3000889 2017-08-16          1   BABY CARE            0  2017      8   16
 2  3000890 2017-08-16          1      BEAUTY            2  2017      8   16
 3  3000891 2017-08-16          1   BEVERAGES           20  2017      8   16
 4  3000892 2017-08-16          1       BOOKS            0  2017      8   16)

## Merge dateset train test with oil

In [290]:
merged_df = pd.merge(train_df, oil_df, on="date", how="left").merge(right=store_df,on="store_nbr",how="left")
merged_test = pd.merge(test_df, oil_df, on="date", how="left").merge(right=store_df,on="store_nbr",how="left")

In [292]:
merged_df.head(),

,id,date,store_nbr,family,onpromotion,year_x,month_x,day_x,dcoilwtico,year_y,month_y,day_y,city,state,type,cluster
0,3000888,2017-08-16,1,0,0,2017,8,16,46.8,2017.0,8.0,16.0,Quito,Pichincha,D,13
1,3000889,2017-08-16,1,1,0,2017,8,16,46.8,2017.0,8.0,16.0,Quito,Pichincha,D,13
2,3000890,2017-08-16,1,2,2,2017,8,16,46.8,2017.0,8.0,16.0,Quito,Pichincha,D,13
3,3000891,2017-08-16,1,3,20,2017,8,16,46.8,2017.0,8.0,16.0,Quito,Pichincha,D,13
4,3000892,2017-08-16,1,4,0,2017,8,16,46.8,2017.0,8.0,16.0,Quito,Pichincha,D,13

In [293]:
merged_test.head()

,id,date,store_nbr,family,onpromotion,year_x,month_x,day_x,dcoilwtico,year_y,month_y,day_y,city,state,type,cluster
0,3000888,2017-08-16,1,0,0,2017,8,16,46.8,2017.0,8.0,16.0,Quito,Pichincha,D,13
1,3000889,2017-08-16,1,1,0,2017,8,16,46.8,2017.0,8.0,16.0,Quito,Pichincha,D,13
2,3000890,2017-08-16,1,2,2,2017,8,16,46.8,2017.0,8.0,16.0,Quito,Pichincha,D,13
3,3000891,2017-08-16,1,3,20,2017,8,16,46.8,2017.0,8.0,16.0,Quito,Pichincha,D,13
4,3000892,2017-08-16,1,4,0,2017,8,16,46.8,2017.0,8.0,16.0,Quito,Pichincha,D,13

In [294]:
merged_df.rename(columns={"type_x": "store_type"}, inplace=True)
merged_df.rename(columns={"type_y": "holiday_type"}, inplace=True)

merged_test.rename(columns={"type_x": "store_type"}, inplace=True)
merged_test.rename(columns={"type_y": "holiday_type"}, inplace=True)

In [74]:
for column_name in merged_df.columns:
    print(column_name)

id
date
store_nbr
family
sales
onpromotion
year_x
month_x
day_x
dcoilwtico
year_y
month_y
day_y
city
state
store_type
cluster
holiday_type
locale
locale_name
description
transferred
year
month
day

In [310]:
columns_to_drop1 = [  'year_x', 'month_x', 'day_x','year_y', 'month_y', 'day_y', 'city', 'state', 'type','cluster']
columns_2=  ['type', 'cluster']

merged_df = merged_df.drop(columns=columns_2)

In [311]:
merged_df

,id,date,store_nbr,family,sales,onpromotion,dcoilwtico
0,0,2013-01-01,1,0,0.000,0,NaN
1,1,2013-01-01,1,1,0.000,0,NaN
2,2,2013-01-01,1,2,0.000,0,NaN
3,3,2013-01-01,1,3,0.000,0,NaN
4,4,2013-01-01,1,4,0.000,0,NaN
...,...,...,...,...,...,...,...
3000883,3000883,2017-08-15,9,28,438.133,0,47.57
3000884,3000884,2017-08-15,9,29,154.553,1,47.57
3000885,3000885,2017-08-15,9,30,2419.729,148,47.57
3000886,3000886,2017-08-15,9,31,121.000,8,47.57
3000887,3000887,2017-08-15,9,32,16.000,0,47.57

In [312]:
## train+oil
merged_df.head(),

(   id       date  store_nbr  family  sales  onpromotion  dcoilwtico
 0   0 2013-01-01          1       0    0.0            0         NaN
 1   1 2013-01-01          1       1    0.0            0         NaN
 2   2 2013-01-01          1       2    0.0            0         NaN
 3   3 2013-01-01          1       3    0.0            0         NaN
 4   4 2013-01-01          1       4    0.0            0         NaN,)

In [313]:
merged_test.head()

        id       date  store_nbr  family  onpromotion  dcoilwtico
0  3000888 2017-08-16          1       0            0        46.8
1  3000889 2017-08-16          1       1            0        46.8
2  3000890 2017-08-16          1       2            2        46.8
3  3000891 2017-08-16          1       3           20        46.8
4  3000892 2017-08-16          1       4            0        46.8

In [314]:
merged_df.isna().sum()

id                  0
date                0
store_nbr           0
family              0
sales               0
onpromotion         0
dcoilwtico     928422
dtype: int64

In [315]:
merged_test.isna().sum()

id                0
date              0
store_nbr         0
family            0
onpromotion       0
dcoilwtico     7128
dtype: int64

In [316]:
oil_df.head()

        date  dcoilwtico  year  month  day
0 2013-01-01         NaN  2013      1    1
1 2013-01-02       93.14  2013      1    2
2 2013-01-03       92.97  2013      1    3
3 2013-01-04       93.12  2013      1    4
4 2013-01-07       93.20  2013      1    7

In [320]:
merged_df['dcoilwtico'].isna().sum()

928422

In [321]:
merged_test['dcoilwtico'].isna().sum()

7128

In [273]:
merged_df['dcoilwtico'].fillna(method='ffill')

0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
           ...
3000883    47.57
3000884    47.57
3000885    47.57
3000886    47.57
3000887    47.57
Name: dcoilwtico, Length: 3000888, dtype: float64

In [322]:
merged_test['dcoilwtico'].fillna(method='ffill')

0        46.80
1        46.80
2        46.80
3        46.80
4        46.80
         ...
28507    47.26
28508    47.26
28509    47.26
28510    47.26
28511    47.26
Name: dcoilwtico, Length: 28512, dtype: float64

In [324]:
merged_df['dcoilwtico'].fillna(method='bfill', inplace=True)

In [325]:
merged_test['dcoilwtico'].fillna(method='bfill', inplace=True)

In [275]:
merged_df['dcoilwtico'].isna().sum()

0

In [326]:
merged_test['dcoilwtico'].isna().sum()

0

In [327]:
merged_df['dcoilwtico'], merged_test['dcoilwtico']

(0          93.14
 1          93.14
 2          93.14
 3          93.14
 4          93.14
            ...
 3000883    47.57
 3000884    47.57
 3000885    47.57
 3000886    47.57
 3000887    47.57
 Name: dcoilwtico, Length: 3000888, dtype: float64,
 0        46.80
 1        46.80
 2        46.80
 3        46.80
 4        46.80
          ...
 28507    47.26
 28508    47.26
 28509    47.26
 28510    47.26
 28511    47.26
 Name: dcoilwtico, Length: 28512, dtype: float64)

In [328]:
X_train = pd.get_dummies(merged_df, columns=['family'], drop_first=True)
Y_train = pd.get_dummies(merged_test, columns=['family'], drop_first=True)

In [277]:
X_train, Y_train

(              id       date  store_nbr     sales  onpromotion  dcoilwtico  \
 0              0 2013-01-01          1     0.000            0       93.14
 1              1 2013-01-01          1     0.000            0       93.14
 2              2 2013-01-01          1     0.000            0       93.14
 3              3 2013-01-01          1     0.000            0       93.14
 4              4 2013-01-01          1     0.000            0       93.14
 ...          ...        ...        ...       ...          ...         ...
 3000883  3000883 2017-08-15          9   438.133            0       47.57
 3000884  3000884 2017-08-15          9   154.553            1       47.57
 3000885  3000885 2017-08-15          9  2419.729          148       47.57
 3000886  3000886 2017-08-15          9   121.000            8       47.57
 3000887  3000887 2017-08-15          9    16.000            0       47.57

          cluster  family_1  family_2  family_3  ...  family_23  family_24  \
 0             13         0         0         0  ...          0          0
 1             13         1         0         0  ...          0          0
 2             13         0         1         0  ...          0          0
 3             13         0         0         1  ...          0          0
 4             13         0         0         0  ...          0          0
 ...          ...       ...       ...       ...  ...        ...        ...
 3000883        6         0         0         0  ...          0          0
 3000884        6         0         0         0  ...          0          0
 3000885        6         0         0         0  ...          0          0
 3000886        6         0         0         0  ...          0          0
 3000887        6         0         0         0  ...          0          0

          family_25  family_26  family_27  family_28  family_29  family_30  \
 0                0          0          0          0          0          0
 1                0          0          0          0          0          0
 2                0          0          0          0          0          0
 3                0          0          0          0          0          0
 4                0          0          0          0          0          0
 ...            ...        ...        ...        ...        ...        ...
 3000883          0          0          0          1          0          0
 3000884          0          0          0          0          1          0
 3000885          0          0          0          0          0          1
 3000886          0          0          0          0          0          0
 3000887          0          0          0          0          0          0

          family_31  family_32
 0                0          0
 1                0          0
 2                0          0
 3                0          0
 4                0          0
 ...            ...        ...
 3000883          0          0
 3000884          0          0
 3000885          0          0
 3000886          1          0
 3000887          0          1

 [3000888 rows x 39 columns],
               id       date  store_nbr     sales  onpromotion  dcoilwtico  \
 0              0 2013-01-01          1     0.000            0       93.14
 1              1 2013-01-01          1     0.000            0       93.14
 2              2 2013-01-01          1     0.000            0       93.14
 3              3 2013-01-01          1     0.000            0       93.14
 4              4 2013-01-01          1     0.000            0       93.14
 ...          ...        ...        ...       ...          ...         ...
 3000883  3000883 2017-08-15          9   438.133            0       47.57
 3000884  3000884 2017-08-15          9   154.553            1       47.57
 3000885  3000885 2017-08-15          9  2419.729          148       47.57
 3000886  3000886 2017-08-15          9   121.000            8       47.57
 3000887  3000887 2017-08-15          9    16.000            0       47.57

          cluster  family_1  family_2  family_3  ...  family_23  family_24  \
 0             13         0         0         0  ...          0          0
 1             13         1         0         0  ...          0          0
 2             13         0         1         0  ...          0          0
 3             13         0         0         1  ...          0          0
 4             13         0         0         0  ...          0          0
 ...          ...       ...       ...       ...  ...        ...        ...
 3000883        6         0         0         0  ...          0          0
 3000884        6         0         0         0  ...          0          0
 3000885        6         0         0         0  ...          0          0
 3000886        6         0         0         0  ...          0          0
 3000887        6         0         0         0  ...          0          0

          family_25  family_26  family_27  family_28  family_29  family_30  \
 0                0          0          0          0          0          0
 1                0          0          0          0          0          0
 2                0          0          0          0          0          0
 3                0          0          0          0          0          0
 4                0          0          0          0          0          0
 ...            ...        ...        ...        ...        ...        ...
 3000883          0          0          0          1          0          0
 3000884          0          0          0          0          1          0
 3000885          0          0          0          0          0          1
 3000886          0          0          0          0          0          0
 3000887          0          0          0          0          0          0

          family_31  family_32
 0                0          0
 1                0          0
 2                0          0
 3                0          0
 4                0          0
 ...            ...        ...
 3000883          0          0
 3000884          0          0
 3000885          0          0
 3000886          1          0
 3000887          0          1

 [3000888 rows x 39 columns])

In [329]:
X_train = merged_df.drop(['sales','date'], axis = 1)
Y_train = merged_df['sales']

In [330]:
X_train, Y_train

(              id  store_nbr  family  onpromotion  dcoilwtico
 0              0          1       0            0       93.14
 1              1          1       1            0       93.14
 2              2          1       2            0       93.14
 3              3          1       3            0       93.14
 4              4          1       4            0       93.14
 ...          ...        ...     ...          ...         ...
 3000883  3000883          9      28            0       47.57
 3000884  3000884          9      29            1       47.57
 3000885  3000885          9      30          148       47.57
 3000886  3000886          9      31            8       47.57
 3000887  3000887          9      32            0       47.57

 [3000888 rows x 5 columns],
 0             0.000
 1             0.000
 2             0.000
 3             0.000
 4             0.000
              ...
 3000883     438.133
 3000884     154.553
 3000885    2419.729
 3000886     121.000
 3000887      16.000
 Name: sales, Length: 3000888, dtype: float64)

In [332]:
X_test = merged_test.drop(['date'], axis=1)

## Normalization

In [341]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

# Transform 'family' column for training data
train_df['family'] = le.fit_transform(merged_df['family'])

# Transform 'family' column for test data
test_df['family'] = le.transform(test_df['family'])

# Assuming 'sales' is the target variable
Y_train = merged_df['sales']
X_train = merged_df.drop(['sales',  'date'], axis=1)

# Assuming X_test is your test data

X_test = merged_test.drop(['date'], axis=1)

In [335]:
# Drop unnecessary columns from the training data
X_train , X_test

(              id  store_nbr  family  onpromotion  dcoilwtico
 0              0          1       0            0       93.14
 1              1          1       1            0       93.14
 2              2          1       2            0       93.14
 3              3          1       3            0       93.14
 4              4          1       4            0       93.14
 ...          ...        ...     ...          ...         ...
 3000883  3000883          9      28            0       47.57
 3000884  3000884          9      29            1       47.57
 3000885  3000885          9      30          148       47.57
 3000886  3000886          9      31            8       47.57
 3000887  3000887          9      32            0       47.57

 [3000888 rows x 5 columns],
             id  store_nbr  family  onpromotion
 0      3000888          1       0            0
 1      3000889          1       1            0
 2      3000890          1       2            2
 3      3000891          1       3           20
 4      3000892          1       4            0
 ...        ...        ...     ...          ...
 28507  3029395          9      28            1
 28508  3029396          9      29            0
 28509  3029397          9      30            1
 28510  3029398          9      31            9
 28511  3029399          9      32            0

 [28512 rows x 4 columns])

In [336]:
X_train, Y_train

(              id  store_nbr  family  onpromotion  dcoilwtico
 0              0          1       0            0       93.14
 1              1          1       1            0       93.14
 2              2          1       2            0       93.14
 3              3          1       3            0       93.14
 4              4          1       4            0       93.14
 ...          ...        ...     ...          ...         ...
 3000883  3000883          9      28            0       47.57
 3000884  3000884          9      29            1       47.57
 3000885  3000885          9      30          148       47.57
 3000886  3000886          9      31            8       47.57
 3000887  3000887          9      32            0       47.57

 [3000888 rows x 5 columns],
 0             0.000
 1             0.000
 2             0.000
 3             0.000
 4             0.000
              ...
 3000883     438.133
 3000884     154.553
 3000885    2419.729
 3000886     121.000
 3000887      16.000
 Name: sales, Length: 3000888, dtype: float64)

## Model

In [339]:
X_test

            id  store_nbr  family  onpromotion
0      3000888          1       0            0
1      3000889          1       1            0
2      3000890          1       2            2
3      3000891          1       3           20
4      3000892          1       4            0
...        ...        ...     ...          ...
28507  3029395          9      28            1
28508  3029396          9      29            0
28509  3029397          9      30            1
28510  3029398          9      31            9
28511  3029399          9      32            0

[28512 rows x 4 columns]

In [367]:
from sklearn.tree import DecisionTreeRegressor
from sklearn.metrics import mean_squared_error, r2_score
import numpy as np

train_model = DecisionTreeRegressor(random_state=1)
train_model.fit(X_train, Y_train)

DecisionTreeRegressor(random_state=1)

In [368]:
predictions = train_model.predict(X_test)

In [369]:
result_df = pd.DataFrame({'id': merged_test['id'], 'sales' : predictions})

In [370]:
result_df.to_csv('sales_prediction_sat10.csv',index = False)

In [364]:
result_df

            id     sales
0      3000888     4.000
1      3000889     0.000
2      3000890     9.000
3      3000891  2242.000
4      3000892     0.000
...        ...       ...
28507  3029395   333.132
28508  3029396   114.120
28509  3029397  1260.093
28510  3029398   121.000
28511  3029399    26.918

[28512 rows x 2 columns]

In [42]:
result_df = pd.DataFrame({'id': test_df['id'], 'sales': predictions})

In [43]:
result_df.head()

        id   sales
0  3000888     4.0
1  3000889     0.0
2  3000890     9.0
3  3000891  2977.0
4  3000892     0.0

In [44]:
result_df.to_csv('sales_prediction_sat1.csv',index = False)

NameError: name 'y_test' is not defined

## Linear

In [365]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
from sklearn.linear_model import LinearRegression

regression = LinearRegression()

regression.fit(X_train, Y_train)

LinearRegression()

In [366]:
predictions1 = regression.predict(X_test)
result_df_Linear = pd.DataFrame({'id': merged_test['id'], 'sales' : predictions1})
result_df_Linear.to_csv('sales_prediction_sat9_linear.csv',index = False)
result_df_Linear

            id        sales
0      3000888   332.788939
1      3000889   321.829019
2      3000890   387.413786
3      3000891  1065.356055
4      3000892   288.949257
...        ...          ...
28507  3029395    83.814270
28508  3029396    34.582005
28509  3029397    61.894429
28510  3029398   357.113259
28511  3029399     1.702244

[28512 rows x 2 columns]